using System;
using static System.Console;

namespace Variables
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*
                C# Variables

                ভ্যারিয়েবল গুলি হল ডাটা ভ্যালু সংরক্ষণের জন্য কন্টেইনার।
                C# এ, বিভিন্ন প্রকারের ভেরিয়েবল রয়েছে (বিভিন্ন কীওয়ার্ড দ্বারা সংজ্ঞায়িত), 
                যেমন: 
                1.	int - দশমিক ছাড়া পূর্ণ সংখ্যা (যেমন, 123 বা -123) সংরক্ষণ করে।
                2. 	double - দশমিক সহ ফ্লোটিং পয়েন্ট সংখ্যা সংরক্ষণ করে, যেমন 19.99 অথবা -19.99।মনে রাখবেন যে আপনার  ডাবলের জন্য "D" দিয়ে শেষ করতে হবে:
                3. 	char - 'a' বা 'B' এর মত একক অক্ষর সংরক্ষণ করে। Char মানগুলো একক ' ' উদ্ধৃতি চিহ্ন দ্বারা বেষ্টিত থাকে।
                4.	 string - টেক্সট স্টোর করে, যেমন "Hello World"। স্ট্রিং "Hello" ভ্যালুগুলো ডাবল কোট দ্বারা বেষ্টিত থাকে।
                5. bool - দুটি অবস্থার মান সংরক্ষণ করে: সত্য বা মিথ্যা।
                6. Long ডাটা টাইপ -9223372036854775808 থেকে 9223372036854775807 পর্যন্ত পূর্ণ সংখ্যা ধারণ করতে পারে। এটি ব্যবহার করা হয় যখন int মানটি ধারণ করার জন্য যথেষ্ট বড় নয়। লক্ষ্য করুন যে আপনাকে মানটি "L" দিয়ে শেষ করতে হবে:
                7. float ফ্লোট এবং ডাবল ডাটা টাইপ ভগ্নাংশ সংখ্যা সঞ্চয় করতে পারে। মনে রাখবেন যে আপনার ফ্লোটের জন্য মানটি "F"  দিয়ে শেষ করতে হবে:
               
                Declaring (Creating) Variables
                একটি ভেরিয়েবল তৈরি করতে, আপনাকে অবশ্যই টাইপটি উল্লেখ করতে হবে এবং এটিকে একটি মান নির্ধারণ করতে হবে:

                Syntax :	Type variableName = value;

                যেখানে টাইপ হল একটি C# টাইপ (যেমন int বা string), এবং variableName হল ভেরিয়েবলের নাম (যেমন x বা name)। ভেরিয়েবলে মান অ্যাসাইন করার জন্য সমান চিহ্ন ব্যবহার করা হয়।
                
                Numbers
                সংখ্যাগুলি দুটি গ্রুপে বিভক্ত করা হয়েছে:

                পূর্ণসংখ্যাগুলি পূর্ণ সংখ্যা সঞ্চয় করে, ধনাত্মক বা ঋণাত্মক (যেমন 123 বা -456), দশমিক ছাড়া। Valid/ন্যায়সঙ্গত/ বৈধ টাইপগুলি হল int এবং long। আপনার কোন টাইপটি ব্যবহার করা উচিত, এটি নির্ভর করে সংখ্যাসূচক মানের উপর।

                ফ্লোটিং পয়েন্ট টাইপগুলি ভগ্নাংশ অংশ সহ সংখ্যাগুলি উপস্থাপন করে, যার মধ্যে একটি বা একাধিক দশমিক রয়েছে। Valid/ন্যায়সঙ্গত/ বৈধ টাইপগুলি হল float এবং double।

                C# এ অনেক সংখ্যক টাইপ থাকলেও, সংখ্যার জন্য সর্বাধিক ব্যবহৃত হল int (পূর্ণ সংখ্যার জন্য) এবং double (দশমিক সংখ্যার জন্য)।

            */
                                                                  //   data type     Size          Description
            byte byteName         =   255;                        //     byte       8 bits           255
            int intNumbers        =   2147483647;                 //     int        4 bytes         -2,147,483,648 থেকে 2,147,483,647 পর্যন্ত পূর্ণ সংখ্যা সংরক্ষণ করে।
            long longNumbers      =   9223372036854775807L;       //     long       8 bytes         -9,223,372,036,854,775,808 থেকে 9,223,372,036,854,775,807 পর্যন্ত পূর্ণ সংখ্যা স্টোর করে
            float floatNumbers    =   1.0125486F;                 //     float      4 bytes          ভগ্নাংশ সংখ্যা সঞ্চয় করে। 6 থেকে 7 দশমিক সংখ্যা সঞ্চয় করার জন্য যথেষ্ট
            double doubleNumbers  =   254.015248524836548D;       //     double     8 bytes          ভগ্নাংশ সংখ্যা সংরক্ষণ করে। 15টি দশমিক সংখ্যা সংরক্ষণের জন্য যথেষ্ট।
            bool boolNumbers      =   true;                       //     bool       1 bit            True বা False মান সংরক্ষণ করে।
            char charValu         =   'c';                        //     char       2 bytes          একক '  ' উদ্ধৃতি চিহ্ন দ্বারা বেষ্টিত একটি একক অক্ষর/বর্ণ সংরক্ষণ করে।
            string stringValu     =   "Md Salim Hossain";         //     string                      টেক্সট স্টোর করে, যেমন "Hello World"। স্ট্রিং "Hello" ভ্যালুগুলো ডাবল কোট দ্বারা বেষ্টিত থাকে।

                                                                    /*
                                                                       ভেরিয়েবলের নামকরণের সাধারণ নিয়মগুলি হল:

                                                                        1.	নাম গুলিতে অক্ষর, সংখ্যা এবং আন্ডারস্কোর চিহ্ন (_) থাকতে পারে।
                                                                        2.	নাম গুলি একটি অক্ষর বা আন্ডারস্কোর দিয়ে শুরু হতে হবে।
                                                                        3.	নাম গুলি ছোট হাতের অক্ষর দিয়ে শুরু হওয়া উচিত এবং এতে whitespace/সাদা স্থান থাকতে পারে না।
                                                                        4.	নাম গুলি কেস-সেনসিটিভ ("myVar" এবং "myvar" হল বিভিন্ন ভেরিয়েবল)।
                                                                        5.	সংরক্ষিত শব্দগুলি (যেমন সি# কীওয়ার্ড, যেমন int বা double) নাম হিসাবে ব্যবহার করা যায় না।                                                                             

                                                                    */

            WriteLine(byteName);                // Outputs :    255 
            WriteLine(intNumbers);              // Outputs :    2147483647
            WriteLine(longNumbers);             // Outputs :    9223372036854775807
            WriteLine(floatNumbers);            // Outputs :    1.0125486
            WriteLine(doubleNumbers);           // Outputs :    254.015248524836548
            WriteLine(boolNumbers);             // Outputs :    true
            WriteLine(charValu);                // Outputs :    c
            WriteLine(stringValu);              // Outputs :    Md Salim Hossain

            ReadLine();
        }
    }
}
